---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ElementsSketchTooLarge
source: html/67bc7fd9-4d37-efa0-6582-c34d14334f15.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ElementsSketchTooLarge Property

The sketch defining the highlighted element is too large.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsSketchTooLarge { get; }
```